In [1]:
import pandas as pd

In [2]:
import pandas as np

In [9]:
df = pd.DataFrame({
    'col1' : [1,2,3,4,5],
    'col2':[45,56,67,34,34],
    'col3':"jalpa ineuron one tech im".split()
})

In [10]:
df

   col1  col2     col3
0     1    45    jalpa
1     2    56  ineuron
2     3    67      one
3     4    34     tech
4     5    34       im

In [5]:
"jalpa ineuron one".split()

['jalpa', 'ineuron', 'one']

In [6]:
df

   col1  col2               col3
0     1    45  jalpa ineuron one
1     2    56  jalpa ineuron one
2     3    67  jalpa ineuron one
3     4    34  jalpa ineuron one
4     5    34  jalpa ineuron one

In [11]:
df['col4'] = df['col1']**2

In [12]:
df['col4']

0     1
1     4
2     9
3    16
4    25
Name: col4, dtype: int64

In [13]:
df

   col1  col2     col3  col4
0     1    45    jalpa     1
1     2    56  ineuron     4
2     3    67      one     9
3     4    34     tech    16
4     5    34       im    25

In [14]:
df['col5'] = df['col3'].str[0]

In [15]:
df

   col1  col2     col3  col4 col5
0     1    45    jalpa     1    j
1     2    56  ineuron     4    i
2     3    67      one     9    o
3     4    34     tech    16    t
4     5    34       im    25    i

In [17]:
def test(a):
    return a**2

In [18]:
test(2)

4

In [19]:
df['col4_4'] = df['col1'].apply(test)

In [20]:
df

   col1  col2     col3  col4 col5  col4_4
0     1    45    jalpa     1    j       1
1     2    56  ineuron     4    i       4
2     3    67      one     9    o       9
3     4    34     tech    16    t      16
4     5    34       im    25    i      25

In [26]:
def test1(a):
    if a == 'j':
        return 'j'
    else:
        return 'z'

In [27]:
df['col6'] = df['col5'].apply(test1)

In [28]:
df

   col1  col2     col3  col4 col5  col4_4 col6
0     1    45    jalpa     1    j       1    j
1     2    56  ineuron     4    i       4    z
2     3    67      one     9    o       9    z
3     4    34     tech    16    t      16    z
4     5    34       im    25    i      25    z

In [29]:
df['col6_6'] = df['col5'].apply(lambda a : 's' if a== 's' else 'z')

In [30]:
df

   col1  col2     col3  col4 col5  col4_4 col6 col6_6
0     1    45    jalpa     1    j       1    j      z
1     2    56  ineuron     4    i       4    z      z
2     3    67      one     9    o       9    z      z
3     4    34     tech    16    t      16    z      z
4     5    34       im    25    i      25    z      z

In [32]:
df['col_7'] = df['col3'].apply(len)

In [33]:
df

   col1  col2     col3  col4 col5  col4_4 col6 col6_6  col_7
0     1    45    jalpa     1    j       1    j      z      5
1     2    56  ineuron     4    i       4    z      z      7
2     3    67      one     9    o       9    z      z      3
3     4    34     tech    16    t      16    z      z      4
4     5    34       im    25    i      25    z      z      2

In [36]:
import math

In [39]:
df['col_8'] = df['col2'].apply(math.log)

In [40]:
df

   col1  col2     col3  col4 col5  col4_4 col6 col6_6  col_7     col_8
0     1    45    jalpa     1    j       1    j      z      5  3.806662
1     2    56  ineuron     4    i       4    z      z      7  4.025352
2     3    67      one     9    o       9    z      z      3  4.204693
3     4    34     tech    16    t      16    z      z      4  3.526361
4     5    34       im    25    i      25    z      z      2  3.526361

In [41]:
import numpy as np

In [42]:
l = [1,2,3,4]

In [43]:
type(l)

list

In [44]:
np.array(l)

array([1, 2, 3, 4])

In [45]:
type(np.array(l))

numpy.ndarray

In [52]:
a1 = np.array([3,4,5,6,3.0])

In [49]:
a = np.array([[1,2],[3,4]])

In [50]:
a

array([[1, 2],
       [3, 4]])

In [51]:
a[(1,1)]

4

In [53]:
a1

array([3., 4., 5., 6., 3.])

In [54]:
a1[2]

5.0

In [58]:
np.array([1,2,3,4],ndmin = 3)

array([[[1, 2, 3, 4]]])

In [62]:
np.asarray([1,23,4,5])

array([ 1, 23,  4,  5])

In [60]:
np.asanyarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [61]:
np.mat([1,2,3,3])

matrix([[1, 2, 3, 3]])

In [64]:
a = [1,2,3,4,5]
np.asarray(a)

array([1, 2, 3, 4, 5])

In [65]:
np.mat(a)

matrix([[1, 2, 3, 4, 5]])

In [66]:
np.asanyarray(a)

array([1, 2, 3, 4, 5])

In [67]:
np.asanyarray(np.mat(a))

matrix([[1, 2, 3, 4, 5]])

In [68]:
np.fromfunction(lambda i , j : i == j, (3,3))

array([[ True, False, False],
       [False,  True, False],
       [False, False,  True]])

In [70]:
np.fromfunction(lambda i , j: i**j, (4,4), dtype = int)

array([[ 1,  0,  0,  0],
       [ 1,  1,  1,  1],
       [ 1,  2,  4,  8],
       [ 1,  3,  9, 27]], dtype=int32)

In [71]:
np.mat(np.fromfunction(lambda i , j: i**j, (4,4), dtype = int))

matrix([[ 1,  0,  0,  0],
        [ 1,  1,  1,  1],
        [ 1,  2,  4,  8],
        [ 1,  3,  9, 27]], dtype=int32)

In [73]:
np.fromfunction(lambda i , j, z: i*j*z, (4,3,2),dtype = int) # three matrixes as a dimension of (3,2)

array([[[0, 0],
        [0, 0],
        [0, 0]],

       [[0, 0],
        [0, 1],
        [0, 2]],

       [[0, 0],
        [0, 2],
        [0, 4]],

       [[0, 0],
        [0, 3],
        [0, 6]]])

In [80]:
a=np.fromfunction(lambda i , j, z, d: i*j*z*d, (4,3,2,2),dtype = int)

In [76]:
np.random.rand(100,4)

array([[0.31692802, 0.44275149, 0.89508001, 0.38416744],
       [0.55294397, 0.88520878, 0.06331632, 0.05271949],
       [0.98956506, 0.896287  , 0.61089053, 0.11751208],
       [0.01796661, 0.54730744, 0.094642  , 0.87237948],
       [0.74568104, 0.98376969, 0.76237486, 0.02658077],
       [0.36990212, 0.27604947, 0.85893684, 0.3563189 ],
       [0.98155713, 0.44642018, 0.51231296, 0.11092856],
       [0.16920116, 0.27475453, 0.7231593 , 0.17656265],
       [0.5186459 , 0.15116717, 0.78424731, 0.51409039],
       [0.64840519, 0.11903303, 0.85536335, 0.14085022],
       [0.99459442, 0.99516817, 0.57096057, 0.36062031],
       [0.6631389 , 0.72180497, 0.99675029, 0.47363135],
       [0.94246902, 0.17921384, 0.26557852, 0.08395097],
       [0.80787366, 0.96524945, 0.35535329, 0.89871266],
       [0.7925545 , 0.07249059, 0.07341803, 0.32478289],
       [0.41776591, 0.85274632, 0.38294811, 0.52049267],
       [0.25560288, 0.96049333, 0.87945813, 0.54957082],
       [0.21150443, 0.89543083, 0.38443112, 0.50413432],
       [0.26780772, 0.84958005, 0.48559886, 0.35698226],
       [0.0827256 , 0.651076  , 0.87944347, 0.48365807],
       [0.13343875, 0.27134253, 0.33243856, 0.36164083],
       [0.29079753, 0.3708753 , 0.06388942, 0.94976072],
       [0.444358  , 0.08179222, 0.58772275, 0.98768267],
       [0.6969592 , 0.98692076, 0.95204921, 0.28387604],
       [0.51232636, 0.92892911, 0.52064223, 0.37886822],
       [0.77985017, 0.89866214, 0.51198543, 0.04324104],
       [0.4641758 , 0.00261531, 0.32557417, 0.69932004],
       [0.07946297, 0.60640953, 0.11812518, 0.90462362],
       [0.69644942, 0.18370892, 0.70118138, 0.91325152],
       [0.98698006, 0.76809819, 0.80753609, 0.8182322 ],
       [0.07755808, 0.0738157 , 0.22487837, 0.21435276],
       [0.49523108, 0.00839487, 0.97053174, 0.84219884],
       [0.26982121, 0.4092708 , 0.12442319, 0.66326237],
       [0.91340772, 0.81772329, 0.77115063, 0.89211396],
       [0.58826785, 0.1685771 , 0.03905537, 0.10236356],
       [0.08735459, 0.42582314, 0.74858359, 0.5942843 ],
       [0.6060142 , 0.10777583, 0.95854099, 0.54343547],
       [0.75922836, 0.73528928, 0.66665409, 0.74722263],
       [0.54086604, 0.98568866, 0.25982123, 0.3555787 ],
       [0.15697875, 0.33130037, 0.8676754 , 0.51145425],
       [0.16659459, 0.25921586, 0.93312517, 0.13119957],
       [0.07455008, 0.25659735, 0.88761205, 0.53865885],
       [0.40736909, 0.0345941 , 0.51017236, 0.89118632],
       [0.78056568, 0.85641618, 0.97302647, 0.75368704],
       [0.45469019, 0.67219758, 0.49741767, 0.55354704],
       [0.49925203, 0.18105747, 0.20814601, 0.57340896],
       [0.07856387, 0.46440039, 0.17068106, 0.17334697],
       [0.99206847, 0.90948027, 0.49472357, 0.43680549],
       [0.55735891, 0.8570933 , 0.47776764, 0.63163641],
       [0.53067562, 0.06155597, 0.07329698, 0.19586264],
       [0.3218842 , 0.55583964, 0.59145117, 0.58438347],
       [0.73606101, 0.44864285, 0.40235165, 0.40272199],
       [0.69341247, 0.52157569, 0.79538819, 0.01767963],
       [0.03826387, 0.50632295, 0.6793591 , 0.11967548],
       [0.61999423, 0.95851885, 0.71708156, 0.17695218],
       [0.99853918, 0.27395569, 0.21784771, 0.80472468],
       [0.99382342, 0.38379148, 0.57909334, 0.87888476],
       [0.79704249, 0.3866078 , 0.93432385, 0.17063186],
       [0.3075649 , 0.15880392, 0.37924981, 0.41669128],
       [0.50789048, 0.57940703, 0.21849095, 0.19452737],
       [0.88674686, 0.15757724, 0.38845401, 0.68494855],
       [0.18328978, 0.47121379, 0.29444458, 0.92981204],
       [0.166421  , 0.10402659, 0.40863296, 0.13715453],
       [0.00409613, 0.0851515 , 0.66256308, 0.90971523],
       [0.53584425, 0.26852595, 0.114591  , 0.11345627],
       [0.38800529, 0.83267581, 0.05395177, 0.0065665 ],
       [0.01376532, 0.06075243, 0.32405204, 0.15004725],
       [0.37781158, 0.12718719, 0.72956674, 0.85792186],
       [0.89584739, 0.97797107, 0.94664186, 0.05830102],
       [0.74877092, 0.23171567, 0.54530602, 0.69304679],
       [0.59549804, 0.40699216, 0.30041512, 0.60004507],
       [0.29840008, 0.41949822, 0.796847  , 0.85023168],
       [0.59861616, 0.09623635, 0.54379311, 0.67490287],
       [0.98555917, 0.68224311, 0.12007877, 0.10637168],
       [0.25412054, 0.15952162, 0.05342749, 0.81768549],
       [0.08804036, 0.02542067, 0.87048187, 0.23201287],
       [0.24836047, 0.74883655, 0.58665179, 0.58413715],
       [0.98732669, 0.07410413, 0.71174455, 0.66629027],
       [0.71735406, 0.30768821, 0.40319996, 0.48318329],
       [0.75144904, 0.85343896, 0.80662423, 0.52646018],
       [0.17455961, 0.47331456, 0.3761596 , 0.57303968],
       [0.77827082, 0.77538549, 0.16009588, 0.5352518 ],
       [0.50786043, 0.27802311, 0.03201212, 0.68351717],
       [0.22969597, 0.54910178, 0.55753598, 0.63084806],
       [0.50900329, 0.89397941, 0.20276418, 0.03730804],
       [0.87131776, 0.43190555, 0.73056894, 0.41374012],
       [0.65053222, 0.24138079, 0.02979893, 0.58164906],
       [0.61649519, 0.51070996, 0.40963901, 0.49514171],
       [0.09897748, 0.82378241, 0.57638608, 0.82436469],
       [0.58385295, 0.27328396, 0.27595776, 0.01561894],
       [0.20625393, 0.79526503, 0.16495354, 0.03029804],
       [0.46728198, 0.36931145, 0.58856939, 0.47387966],
       [0.97942344, 0.29583863, 0.02110943, 0.02903166],
       [0.4144908 , 0.61995939, 0.58701417, 0.2320833 ],
       [0.05283139, 0.08471821, 0.57111674, 0.1831947 ],
       [0.19536873, 0.73069687, 0.27680546, 0.27605146],
       [0.99524758, 0.11614265, 0.09841673, 0.70195827],
       [0.52619099, 0.8506744 , 0.91428574, 0.35952767],
       [0.03656214, 0.89495884, 0.84637834, 0.00418704],
       [0.42573497, 0.27277786, 0.86377714, 0.17004631]])

In [77]:
np.random.randint(4,50)

8

In [78]:
np.random.randn(4,5)

array([[ 0.12626057, -0.63491158,  0.61191371,  1.32186571, -0.22906826],
       [ 0.12786145,  2.23243581,  0.9278023 , -0.91305049,  1.54552947],
       [-0.70500354,  0.77977123,  0.55557874,  1.90156373, -1.00153933],
       [ 0.60877857,  0.08030062, -0.58240312, -0.62479677,  0.52346557]])

In [79]:
pd.DataFrame(np.random.randn(4,5))

          0         1         2         3         4
0 -0.351473  1.523768  0.432357 -0.638787  1.374261
1 -0.962125  0.392872  0.183973  1.586318 -0.035486
2  0.587642 -2.085147 -0.819532 -0.755066  1.029830
3 -1.058371  0.339291  1.318349  1.159974  1.180579

In [81]:
a

array([[[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 1]],

        [[0, 0],
         [0, 2]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 2]],

        [[0, 0],
         [0, 4]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 3]],

        [[0, 0],
         [0, 6]]]])

In [84]:
a.reshape(12,4,-234)

array([[[0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [1]],

       [[0],
        [0],
        [0],
        [2]],

       [[0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [2]],

       [[0],
        [0],
        [0],
        [4]],

       [[0],
        [0],
        [0],
        [0]],

       [[0],
        [0],
        [0],
        [3]],

       [[0],
        [0],
        [0],
        [6]]])